# SQL Bolt

## Interactive Tutorial

[https://sqlbolt.com/](https://sqlbolt.com/)

### SQL Lesson 1: SELECT queries

#### Task 1

Find the title of each film

`SELECT title 
FROM movies;`

#### Task 2

Find the director of each film

`SELECT director 
FROM movies;`

#### Task 3

Find the title and director of each film

`SELECT 
    title,
    director 
FROM movies;`

#### Task 4

Find the title and year of each film

`SELECT 
    title,
    year 
FROM movies;`

#### Task 5

Find all the information about each film

`SELECT * 
FROM movies;`

### SQL Lesson 2: Queries with constraints (Pt. 1)

#### Task 1

Find the movie with a row id of 6

`
SELECT *
FROM 
    movies
WHERE 
    id = 6;
`

#### Task 2

Find the movies released in the years between 2000 and 2010

`SELECT * 
FROM 
    movies
WHERE 
    year BETWEEN 2000 and 2010;`

#### Task 3

Find the movies not released in the years between 2000 and 2010

`SELECT * 
FROM 
    movies
WHERE 
    year NOT BETWEEN 2000 and 2010;`

#### Task 4

Find the first 5 Pixar movies and their release year

`SELECT 
    title,
    year
FROM 
    movies
WHERE 
    year < 2004;`

### SQL Lesson 3: Queries with constraints (Pt. 2)

#### Task 1

 Find all the Toy Story movies

`
SELECT * 
FROM 
    movies
WHERE
    title LIKE 'Toy Story%';
`

#### Task 2

Find all the movies directed by John Lasseter

`SELECT * 
FROM 
    movies
WHERE
    director = 'John Lasseter';`

#### Task 3

Find all the movies (and director) not directed by John Lasseter

`SELECT
    title,
    director
FROM 
    movies
WHERE
    director != 'John Lasseter';`

#### Task 4

Find all the WALL-* movies

`SELECT *
FROM 
    movies
WHERE
    title LIKE 'WALL-_';`

### SQL Lesson 4: Filtering and sorting Query results

#### Task 1

List all directors of Pixar movies (alphabetically), without duplicates

`
SELECT
    DISTINCT(director)
FROM 
    movies
ORDER BY director ASC;
`

#### Task 2

List the last four Pixar movies released (ordered from most recent to least)

`SELECT *
FROM 
    movies
ORDER BY year DESC
LIMIT 4;`

#### Task 3

List the first five Pixar movies sorted alphabetically

`SELECT *
FROM 
    movies
ORDER BY title ASC
LIMIT 5;`

#### Task 4

List the next five Pixar movies sorted alphabetically

`SELECT *
FROM 
    movies
ORDER BY title ASC
LIMIT 5 OFFSET 5;`

### SQL Lesson 5: Simple SELECT Queries Review

#### Task 1

List all the Canadian cities and their populations

`SELECT
    city, 
    country, 
    population
FROM 
    north_american_cities
WHERE
    country = 'Canada';`

#### Task 2

Order all the cities in the United States by their latitude from north to south

`SELECT
    city, 
    country, 
    latitude
FROM 
    north_american_cities
WHERE
    country = 'United States'
ORDER BY
    latitude DESC;`

#### Task 3

List all the cities west of Chicago, ordered from west to east

`SELECT
    city, 
    country, 
    longitude
FROM 
    north_american_cities
WHERE
    longitude < -87.629798
ORDER BY
    longitude ASC;`

#### Task 4

List the two largest cities in Mexico (by population)

`SELECT
    city, 
    country, 
    population
FROM 
    north_american_cities
WHERE
    country = 'Mexico'
ORDER BY
    population DESC
LIMIT 
    2;`

#### Task 5

List the third and fourth largest cities (by population) in the United States and their population

`SELECT
    city, 
    country, 
    population
FROM 
    north_american_cities
WHERE
    country = 'United States'
ORDER BY
    population DESC
LIMIT 
    2
OFFSET 
    2;`

### SQL Lesson 6: Multi-table queries with JOINs

#### Task 1

Find the domestic and international sales for each movie

`SELECT 
    title,
    domestic_sales,
    international_sales
FROM 
    movies
INNER JOIN boxoffice
    ON movies.id = boxoffice.movie_id;`

#### Task 2

Show the sales numbers for each movie that did better internationally rather than domestically

`SELECT 
    title,
    domestic_sales,
    international_sales
FROM 
    movies
INNER JOIN boxoffice
    ON movies.id = boxoffice.movie_id
WHERE 
    international_sales > domestic_sales;`

#### Task 3

List all the movies by their ratings in descending order

`SELECT 
    title,
    rating
FROM 
    movies
INNER JOIN boxoffice
    ON movies.id = boxoffice.movie_id
ORDER BY
    rating DESC;`

###  SQL Lesson 7: OUTER JOINs

#### Task 1

Find the list of all buildings that have employees

`SELECT 
    DISTINCT(building_name)
FROM 
    buildings AS l
INNER JOIN employees AS r
    ON l.building_name = r.building;`

#### Task 2

Find the list of all buildings and their capacity

`SELECT 
    DISTINCT(building_name),
    capacity
FROM 
    buildings AS l
LEFT JOIN employees AS r
    ON l.building_name = r.building;`

#### Task 3

List all buildings and the distinct employee roles in each building (including empty buildings)

`SELECT 
    DISTINCT(building_name),
    role
FROM 
    buildings AS l
LEFT JOIN employees AS r
    ON l.building_name = r.building;`

###  SQL Lesson 8: A short note on NULLs

#### Task 1

Find the name and role of all employees who have not been assigned to a building

`SELECT
    name,
    role,
    building
FROM 
    employees
WHERE
    building IS NULL;`

#### Task 2

Find the names of the buildings that hold no employees

`SELECT
    building_name,
    name
FROM 
    buildings AS l
LEFT JOIN
    employees AS r
    ON l.building_name = r.building
WHERE
    name IS NULL`

###  SQL Lesson 9: Queries with expressions

#### Task 1

List all movies and their combined sales in millions of dollars

`SELECT
    title,
    (domestic_sales + international_sales) / 1000000 AS combined_sales
FROM 
    movies
INNER JOIN
    boxoffice
    ON movies.id = boxoffice.movie_id
ORDER BY 
    combined_sales DESC;`

#### Task 2

List all movies and their ratings in percent

`SELECT
    title,
    rating * 10 AS ratings_pct
FROM 
    movies
INNER JOIN
    boxoffice
    ON movies.id = boxoffice.movie_id
ORDER BY
    ratings_pct DESC;`

#### Task 3

List all movies that were released on even number years

`SELECT
    title,
    year
FROM 
    movies
WHERE
    year % 2 = 0
ORDER BY 
    year ASC;`

###  SQL Lesson 10: Queries with aggregates (Pt. 1)

#### Task 1

Find the longest time that an employee has been at the studio

`SELECT 
    MAX(years_employed) 
FROM 
    employees;`

#### Task 2

For each role, find the average number of years employed by employees in that role

`SELECT 
    role,
    AVG(years_employed) AS avg_years_empl
FROM 
    employees
GROUP BY
    role;`

#### Task 3

Find the total number of employee years worked in each building

`SELECT 
    building,
    SUM(years_employed)
FROM 
    employees
GROUP BY
    building;`

###  SQL Lesson 11: Queries with aggregates (Pt. 2)

#### Task 1

Find the number of Artists in the studio (without a HAVING clause)

`SELECT 
    COUNT(role)
FROM 
    employees
WHERE
    role = 'Artist';`

#### Task 2

Find the number of Employees of each role in the studio

`SELECT 
    role,
    COUNT(role)
FROM 
    employees
GROUP BY
    role;`

#### Task 3

Find the total number of years employed by all Engineers

`SELECT 
    role,
    SUM(years_employed)
FROM 
    employees
GROUP BY
    role
HAVING
    role = 'Engineer';`